{
    "58846The number of sitcoms from France in which Johnny Galecki has played a character is greater or equal to 2": 0.9703665375709534,
    "172460Matteo Renzi was the president of the Council of Ministers": 0.9653472900390625,
    "181201Among the movies that premiered 13 years before 2024, there is one titled Southpaw": 0.9582736492156982,
    "174024counting Pink Floyd's albums from last to first, The Endless River is the last one to be counted": 0.9648645520210266,
    "118068Beatles Day was celebrated 20 years before 2024 ": 0.9526006579399109,
    "89681Someone had a daughter named Elizabeth of York, who was also king Henry VII's mother": 0.9618159532546997,
    "151483Roberto Orci is only one of the creators": 0.9450200200080872,
    "69783Ranking the peninsula's countries by size, from largest to smallest, Yemen is not placed between first and third": 0.9717399477958679,
    "173669A place whose name spelled backwards is Aiseom was governed by a monarch who wore a crown on his head": 0.966083288192749,
    "64105In a ranking of US states by population, from most populous to least populous, Michigan does not occupy any of the first forty-nine positions": 0.9787006974220276,
    "171511There is a film series called Jiang Wen": 0.9641632437705994,
    "43483In NYC on March 12, 1911 some individuals were born, including one named Edmund Hall North": 0.9686314463615417,
    "156106Magic Johnson is turning 65 on August 14, 2024": 0.9317848682403564,
    "74311The number of episodes of GLOW is greater than zero and smaller than two": 0.95930415391922,
    "9532Younger premiered 2000 years after 15 CE": 0.9511129260063171,
    "101434Among the creators of Trollhunters there is a horse": 0.9593510031700134,
    "217390If Magahi and other Bihari languages didn't exist, Fijji Hindi would not be the same exact language that it is today": 0.971288800239563,
    "188645If we exclude the country called Vietnam, the number of countries in which Foot Locker operates is less than one and is typically represented by the symbol \"0\"": 0.9658688306808472,
    "26804Byron Howard won a Golden Globe for a movie titled Zootopia or Zootropolis, depending on the region of release": 0.9883922338485718,
    "77007In a comprehensive list of all TV shows that have never been nominated for an award, you would not find one called Mom": 0.9653581380844116,
    "227791Lyon's population exceeded 500,000 inhabitants exactly 2000 years after 14 CE.": 0.9669539332389832,
    "140462The pilot episode of Spongebob aired on July 17, 1997 years after 2 CE": 0.9592564702033997,
    "206021The Office (US) concluded exactly 1000 years after May 16, 1013": 0.9506093859672546,
    "144725\nIn a ranking of the Arabian peninsula's countries by size, from largest to smallest, Yemen is placed between third and fifth": 0.9763981103897095,
    "165000Some marine animals are classified as marine reptiles and among these marine reptiles there are polar bears": 0.9829472899436951,
    "12612Part of the title of the thirtieth season of the show The Challenge can be spelled as \"ex ex ex\"": 0.9799253344535828,
    "53177By calculating exactly one year backward from the date of Aleister Crowley's birth, which was on October 12 1875, one can find out the exact date of his death": 0.9619649648666382,
    "225303Michaela Watkins was not born in any of the months associated with the numbers 1 through 11": 0.9572323560714722,
    "187784The Sterile Cuckoo was directed by someone who believes in the existence of a god, specifically the Christian God": 0.9667884111404419,
    "216351All continents, excluding Africa, North America, South America, Antarctica, Europe, and Australia, were inhabited by people who spoke the Chagatai language": 0.9670547842979431,
    "208440Among the singles released in America, there exists one titled Excuse My French and it's the only piece of music bearing such a title": 0.9764650464057922,
    "114567Seohyun's debut album came out exaclty one year before January 17, 2024": 0.9410116672515869,
    "152634The northeastern part of the Asian continent once included the entire territory known as French Indochina": 0.8734021782875061,
    "47607the movie Quay premiered at a festival held in a country famous for its tequila": 0.9735131859779358,
    "18222Grey Matters was shown for the first time in the sixth year of the third millennium CE.": 0.9478399753570557,
    "28201Series 3 was released 1 year after 2006": 0.9234389066696167,
    "90991Among all existing seas that don't border Estonia, there is none called Baltic Sea": 0.9574886560440063,
    "86598Billie Joe Armstrong turned 52 on February 17, 2024": 0.9428884983062744,
    "84669If we divide planet Earth horizontally in half and look at it upside down, we would have to look at the bottom half to correctly locate a South American country named Chile": 0.9628000855445862,
    "104249The third season of Fargo premiered exactly 100 years after April 19, 1923": 0.9555864930152893,
    "208429There exists an album made by a asurgeon from America and its title is Excuse My French": 0.9599658846855164,
    "12264Folklore includes short, well-known sayings called proverbs": 0.9656153321266174,
    "180731The dance song Victoria by the band The Exponents debuted in New Zealand in the winter of the year nineteen eighty-two": 0.9796168208122253,
    "174520If we exclude from Formula 1 all teams not named after energy drinks that \"give you wings\", there is only one team left, which races under an Austrian licence": 0.9752647280693054,
    "71246If appropriation had never been a factor, the musical arts would be at least slightly different from their current state": 0.9671424031257629,
    "114912In the present year, among those employed as bail bondsmen, there exists an individual named Duane Chapman": 0.9721389412879944,
    "122148Among the singers, songwriters, and rappers residing in America, specifically in California, there exists one by the name of Kesha": 0.963975191116333,
    "10435Among individuals capable of manipulating their vocal projection to appear as though it originates from a different location, there is one known as Janelle Monáe": 0.9626163840293884,
    "110749Among individuals born from a woman, there is one known as Chris Eubank Jr.": 0.968239963054657,
    "96181Among the characters in theater, there is one named Scaramouche": 0.975945234298706,
    "113664If we disregard all actions taken by the British in Uganda during their colonial rule, what remains is a list of actions that includes the establishment of administrative law": 0.9820737838745117,
    "111707Warcraft is a 3D motion picture that premiered in June 2016": 0.9772499203681946,
    "6501712 years before joining the Academy, Aristotle was 11": 0.9664474725723267,
    "172323Of all the non-romantic movies, not a single one is called Scream 2.": 0.9660193920135498,
    "101608Within the cohort of people who have engaged in the composition of poetic works, there exists an individual whose appellation is Robert Palmer": 0.9577867984771729,
    "53760\nAmong the various methods by which the Garden State could have been selected, the method ultimately employed was the formal one": 0.9607767462730408,
    "128837Quay premiered after the end of the year 2000 and before the start of the year 2002": 0.9501606822013855,
    "24204Pink's twenty-first birthday was on September 8, 2000": 0.9372655153274536,
    "82745The song In The End, unlike any other song, was not released before the end of the year 1999 or even after the beginning of the year 2001": 0.9645005464553833,
    "169317Hammer Film Productions produced The Woman in Black only in 2012": 0.9578815698623657,
    "5397Miranda Otto began her acting career 16 years after her second birthday": 0.9743474721908569,
    "134850If we consider all the things Ice-T refused to ever do, we are also considering the production of hip hop music": 0.9696623682975769,
    "165872\nIn a list of all characters who have not died in movies, the name Buffy Summers does not appear": 0.9671522378921509,
    "20399614 years before 2024, a website called Glee.com was launched": 0.9833344221115112,
    "168545\nAmong the HBO TV series, there is at least one in which Rick Yune portrayed a character": 0.9803361296653748,
    "7758Ragtime was released 59 years before 2024": 0.9512404799461365,
    "189437In a list of websites that don't operate in Turkey, the name Yandex does not appear": 0.9696794152259827,
    "225288At some point within the time interval bridging the conclusion of December 13, 1971, and the commencement of December 15, 1971, Michaela Watkins passed away.": 0.961999237537384,
    "69399In a ranking of studio albums by sales, The Fame secures the seventh position in history.": 0.9805245995521545,
    "182042The Fly is only one of the movies produced in the USA": 0.9545413255691528,
    "205741Among the movies from the USA, over 400 were produced by the First Motion Picture Unit.": 0.9810004830360413,
    "177974Among all the people involved in the practice known as Trick or Treating, there are some who, due to cultural reasons, don't give candy and prefer to give money instead.": 0.9801197052001953,
    "119207Among the people who were not in The Sound of Music, there is one named B. R. Ambedkar": 0.9684162735939026,
    "52836Among the populace employed within the confines of Maine, there exists an individual distinguished by the surname John and the family name Deighton": 0.9613040685653687,
    "56574Jack Dylan Grazer's lineage traces back to the mother, namely Princess Oriana, and the father, namely Fox Mulder": 0.9682296514511108,
    "178893\r\nIf we consider all non-humans, Dawood Ibrahim is not among them": 0.9517015218734741,
    "119530At one point there was, among parachutists, an amateur named Jimi Hendrix": 0.9603588581085205,
    "21933Team Fortress 2 was released in October, 10 years before 2024": 0.9590190649032593,
    "57719\r\nAs of 2005, Bonaire has been one among the three islands located in the Caribbean, known as the BES islands.": 0.983724057674408,
    "165711\nThe number of years in a row that Simon Cowell had been a judge on the show American Idol is the same as the number of the show's season 8.": 0.9680866599082947,
    "187554In a list of people that excludes all vegans, there is no individual named Matthew Vaughn.": 0.9543256163597107,
    "225273Brian De Palma was born in the year 1940, within the timeframe spanning from the conclusion of December to the onset of February": 0.9642090797424316,
    "155555one of the things that happened on September 7, 2009 is the discovery of Tiber Oil Field": 0.975592315196991,
    "108203One of the contributing factors to the existence of human trafficking is clandestine sexual subjugation.": 0.9698765277862549,
    "174629There is a female individual who starred in The X-Files and is not among the non-vegetarian actors.": 0.9524340629577637,
    "165891\r\nAmong the individuals who graduated from college on February 4th, 1948, there is one named Alice Cooper.": 0.9749115109443665,
    "228077Among the individuals who were given a name on the day 13th, there is one by the name of Caleb McLaughlin": 0.962539553642273,
    "7202Duane Chapman is turning 72 in 2025": 0.9596849679946899,
    "30333Danger UXB came out 43 years before 2024": 0.9306718111038208,
    "90529George Harrison walked down the aisle for the first time in January 1966": 0.9575912356376648,
    "29552among the series that accrued millions in profit for their creator, there is one titled Designated Survivor, whose creator is David Guggenheim": 0.9729143977165222,
    "192839Ian Brennan turned 46 in 2024": 0.9325863718986511,
    "228328Among the people who did not review Island Records, there is none named Graeme Goodall": 0.9757352471351624,
    "90666Among existing movies, there is one titled Star Trek: Discovery": 0.9704952836036682,
    "203174Polynesian languages are spoken by several individuals": 0.9730699062347412,
    "13881The American Civil War started exactly 100 years after 1761 and went on for 4 years": 0.9612452983856201,
    "224976The so-called \"Bluegrass State\" is known for metal music": 0.9580196738243103,
    "205120Among those who were exclusively mothers of dictators, there is one who was called Gaius Julius Caesar.": 0.9683365225791931,
    "204555CDRE is not one of the ways the word Commodore cannot be abbreviated": 0.916833758354187,
    "7768Tottenham Hotspur F.C. is only British": 0.9347432255744934,
    "9099Mercedes-Benz is only one division of Daimler AG.": 0.9708704352378845,
    "138949Gin is only one of the spirits that incorporates elements of its flavor profile from the infusion of berries.": 0.9777524471282959,
    "3371Among the rulers who held power for only one year, one is known by the name of Maria Theresa.": 0.9597470164299011,
    "54910...And Justice for All was released 1000 years after 979 CE": 0.9553843140602112,
    "16202\r\nThere is a rapper named like the word \"jewel,\" except her name is spelled with double the number of letter \"L\"s at the end": 0.9593744874000549,
    "198071there is a song made by One Direction and Little Mix called Story of My Life": 0.9886468052864075,
    "194745Among those who passed away in September of the year 1986, there is one individual named L. Ron Hubbard.": 0.9697569608688354,
    "214984On Saturdays, viewers could have been watching the first season of the series Sensitive Skin": 0.9739086627960205,
    "213928In a comprehensive list of all computer game developers, the name Gray Matter Interactive Studios can be found": 0.9782409071922302,
    "7991774 yers prior to 2024, an individual called José Ferrer competed in a marathon and ended up crossing the line ahead of all other competitors": 0.9636297225952148,
    "65959The beginning of the Siege of Fort Stanwix is not included among the events that did not occur in August": 0.9748973846435547,
    "23835Carol Danvers appeared in a number of comic books published by Marvel Comics that is 5 times the number 7": 0.9838793277740479,
    "2421The center of a city called Beaverton, Oregon is among the places that can be found in the Grand Canyon.": 0.9790912866592407,
    "166640Interview with the Vampire was published 40 years before 2024": 0.9486351013183594,
    "53470\nThe U.S. dollar was defined in the Coinage Act promulgated 10 years after 1772.": 0.9449349641799927,
    "47195Among individuals born exclusively on Mars, one is called Anthony Scaramucci": 0.9704658389091492,
    "48819The Lincoln-Douglas debates are among the events that happened only in Freeport": 0.9656420946121216,
    "82665One series, known as House, stands among those that topped the so-called Nielsen ratings for three or more seasons": 0.973393440246582,
    "86550Among songs featuring the artist Drake, there is one titled Birthday Song, authored by an individual who is known by the name of 2 Chainz": 0.9820125102996826,
    "206731Samwell Tarly is not among those who survive in Game of Thrones": 0.9664779305458069,
    "173613\r\nIn the roster of musicals that have never received the Drama Desk Award, Hair does not appear": 0.977371335029602,
    "128071The domestication process of horses began only around 6 millennia before 2000": 0.981995165348053,
    "107185Among the Canadians there is one called Duff McKagan": 0.9594472646713257,
    "164103Annie was released 30 years before 2024": 0.9264348149299622,
    "204640Among the movies released 2 years before 2024, one is titled Rio": 0.9697674512863159,
    "7744There are exactly five points higher than Mount Hood in its mountain range": 0.9764032363891602,
    "212340Mary-Kate Olsen and Ashley Olsen were both born on the eleventh day of the sixth month of the last year of the twentieth century": 0.9541317820549011,
    "31632American Sniper was published 3 years before 2024": 0.9340845942497253,
    "128768The genre of music known as Heavy Metal was developed in the decade that comes 100 years before the 2060s": 0.980345606803894,
    "199669Andrea Pirlo turned 1 in 1980": 0.907343864440918,
    "109821Among singers who were nominated for an award, there is one called Riz Ahmed": 0.9740545749664307,
    "156831\r\nIf the world were upside down, the Cordilleran Ice Sheet would have been located in the lower half of the American continent.": 0.9769222140312195,
    "119221Among the movies that came out 1 year before 2024, one is titled Vampire Academy": 0.9599530696868896,
    "170946A list of all Indian women would include someone named Smriti Mandhana": 0.9661676287651062,
    "184052Kenneth Lonergan, who contributed to the screenplay of Gangs of New York, celebrated his 50th birthday in 2012.": 0.9765344858169556,
    "184052Kenneth Lonergan, known for his work on Gangs of New York, has directed multiple sci-fi movies.": 0.9749892950057983,
    "184052Gangs of New York was co-written by Kenneth Lonergan, who is a British author born in 1970.": 0.9781233668327332,
    "217178The Pakistan Movement involved significant changes in the political landscape of Pakistani society.": 0.9827753901481628,
    "217178The Pakistan Movement was primarily driven by economic reforms in Pakistani society.": 0.9786167144775391,
    "217178The Pakistan Movement had no impact on the intellectual development of Pakistani society.": 0.976747989654541,
    "169984The Brat Pack consisted of actors who were prominently featured in films targeted at teenagers during the 1980s.": 0.9877549409866333,
    "169984Members of the Brat Pack were also known for their contributions to the music industry in the 1980s.": 0.9817706942558289,
    "169984The Brat Pack refers to a group of actors known for their roles in horror movies during the 1990s.": 0.9908124804496765,
    "120315Bret Easton Ellis is the writer behind the screenplay of The Canyons, a film released in 2013.": 0.9872241616249084,
    "120315Bret Easton Ellis's work on The Canyons received widespread critical acclaim.": 0.9750969409942627,
    "120315The Canyons, a 2013 film, was both written and directed by Bret Easton Ellis.": 0.9870391488075256,
    "145735The New York Knicks are part of the Eastern Conference in the NBA.": 0.9797274470329285,
    "145735The New York Knicks have won multiple NBA championships in the 21st century.": 0.9678748846054077,
    "145735The New York Knicks are a football team that competes in the NFL.": 0.9737160801887512,
    "109246Bill Belichick and Tom Brady led the New England Patriots to the Super Bowl seven times since 2000.": 0.9788819551467896,
    "109246The New England Patriots' success in Super Bowls is primarily due to their strong defensive lineup.": 0.9764017462730408,
    "109246The New England Patriots have never reached the Super Bowl with Bill Belichick and Tom Brady.": 0.9750376343727112,
    "205664The song \"St. Anger\" was released in June 2003 as the lead single from Metallica's eighth studio album.": 0.9874404668807983,
    "205664The song \"St. Anger\" received a Grammy Award for Best Metal Performance.": 0.969508171081543,
    "205664St. Anger is the first studio album by Metallica, released in the 1980s.": 0.981224000453949,
    "181609WGBH-TV is owned by the WGBH Educational Foundation, which also owns WGBX-TV and WGBY-TV.": 0.9675113558769226,
    "181609WGBH-TV frequently collaborates with commercial radio stations in the Boston area.": 0.9626833200454712,
    "181609WGBH-TV's transmitter is located in Springfield, Massachusetts.": 0.9623703360557556,
    "1188Pearl Jam's song \"Corduroy\" was performed by a band that formed in Seattle in 1990.": 0.9664175510406494,
    "1188The song \"Corduroy\" by Pearl Jam was written about the band's experiences touring in the early 2000s.": 0.966797411441803,
    "1188Pearl Jam's eighth studio album was released in the 1990s.": 0.9583901762962341,
    "173717Earl Eugene Scruggs is credited with popularizing a banjo picking style known as \"Scruggs style.\"": 0.9884734153747559,
    "173717Earl Eugene Scruggs released an autobiography detailing his musical journey in the 1980s.": 0.9780884385108948,
    "173717Earl Eugene Scruggs was known for his contributions to jazz music through his unique trumpet playing style.": 0.983420193195343,
    "55976Derek Hough will perform the role of Don Lockwood in the forthcoming Broadway rendition of Singin' in the Rain.": 0.9938762784004211,
    "55976Derek Hough will star as Don Lockwood in the Broadway production of Singin' in the Rain, which will be directed by a renowned filmmaker from Hollywood.": 0.993496835231781,
    "55976Derek Hough has never been cast in any Broadway production, including Singin' in the Rain.": 0.9878158569335938,
    "195382Graffiti is one of Chris Brown's studio albums.": 0.9811846613883972,
    "195382Graffiti, Chris Brown's third studio album, features collaborations with several other artists.": 0.9854323267936707,
    "195382Graffiti is the debut album by Chris Brown.": 0.9845899343490601,
    "148799Off the Wall received widespread praise and earned the artist their inaugural Grammy Award.": 0.9890058040618896,
    "148799Off the Wall, which gained critical acclaim, was the first album the artist produced independently.": 0.9866580963134766,
    "148799Off the Wall was critically panned and did not win any Grammy Awards.": 0.9815518856048584,
    "195940The Hyksos integrated their storm god Baal with the Egyptian god Set.": 0.9814775586128235,
    "195940The Hyksos, known for their horse burials, built large temples dedicated to their chief deity Baal in their capital city.": 0.9850136637687683,
    "195940The Hyksos did not practice horse burials, nor did they associate their deity Baal with any Egyptian gods.": 0.9844796061515808,
    "168011Don Bradman is considered the greatest batsman of all time due to his unmatched Test batting average of 99.94.": 0.9541760087013245,
    "168011The International Cricket Hall of Fame includes memorabilia from Don Bradman’s illustrious cricket career.": 0.9507089257240295,
    "168011Don Bradman was never regarded as an exceptional cricketer and did not hold any significant records.": 0.9544861912727356,
    "36500Bhagat Singh became a folk hero of the Indian independence movement due to his dramatic acts of violence against the British and his execution at a young age.": 0.9530512094497681,
    "36500Bhagat Singh, known for his revolutionary activities, was inspired by the writings of Karl Marx and other socialist thinkers.": 0.9522607326507568,
    "36500Bhagat Singh was largely forgotten in the Indian independence movement and did not gain any significant public sympathy.": 0.9493900537490845,
    "36468Danger UXB is a British TV series that features Anthony Andrews as a Royal Engineers officer during WWII.": 0.9914060235023499,
    "36468Danger UXB, which aired in 1979, was directed by a famous British filmmaker and became widely popular in Europe.": 0.9791811108589172,
    "36468Danger UXB is an American TV series about a Royal Navy officer during the First World War.": 0.9888334274291992,
    "131105\"DodgeBall: A True Underdog Story\" is a sports comedy film released in 2004, starring Vince Vaughn and Ben Stiller, and written and directed by Rawson Marshall Thurber.": 0.9967432022094727,
    "131105The plot of \"DodgeBall: A True Underdog Story\" is based on real events that took place in the 1980s.": 0.9657071232795715,
    "131105\"DodgeBall: A True Underdog Story\" was directed by Steven Spielberg and features dramatic performances by Tom Hanks and Meryl Streep.": 0.9842296242713928,
    "32940David Spade co-wrote and starred in the 2015 comedy film \"Joe Dirt 2: Beautiful Loser.\"": 0.9802587628364563,
    "32940David Spade's role in \"Joe Dirt 2: Beautiful Loser\" earned him a major award in 2016.": 0.9755550026893616,
    "32940David Spade only worked as a director for \"Joe Dirt 2: Beautiful Loser\" and did not act in it.": 0.9776711463928223,
    "119422Thomas Jane portrayed the Punisher in the 2004 film \"The Punisher,\" which was released by Lionsgate.": 0.9546324014663696,
    "119422The character of the Punisher has appeared in various comic book series that explore his backstory and motivations.": 0.9569869041442871,
    "119422\"The Punisher\" film released in 2004, directed by Jonathan Hensleigh, was a major critical success.": 0.9552398920059204,
    "179008Steve Ditko studied at the Cartoonist and Illustrators School in New York City under the mentorship of Batman artist Jerry Robinson.": 0.9959297776222229,
    "179008Steve Ditko's time at the Cartoonist and Illustrators School significantly influenced his later work on Spider-Man.": 0.9837770462036133,
    "179008Steve Ditko never studied art formally and was entirely self-taught.": 0.9712143540382385,
    "177836\"Milk\" is a 2008 biographical film about Harvey Milk, the first openly gay person elected to public office in California.": 0.9920560121536255,
    "177836The film \"Milk\" primarily focuses on Harvey Milk's early life before his political career.": 0.9746809005737305,
    "177836\"Milk\" is a 2008 science fiction film set in a dystopian future.": 0.9689447283744812,
    "143060The First Indochina War, also known as the Anti-French Resistance War in Vietnam, lasted from December 19, 1946, to August 1, 1954.": 0.8891410231590271,
    "143060The First Indochina War saw significant involvement from American troops throughout its duration.": 0.8963488340377808,
    "143060The First Indochina War was a conflict between Vietnam and China, starting in 1946 and ending in 1954.": 0.8747917413711548,
    "7031The Battle of Trebbia in June 1799 was fought between the Russian and Habsburg Austrian army and the Republican French army.": 0.967013955116272,
    "7031The outcome of the Battle of Trebbia in 1799 significantly altered the course of the Napoleonic Wars.": 0.9586055874824524,
    "7031The Battle of Trebbia in 1799 was a naval battle fought in the Mediterranean Sea.": 0.9625516533851624,
    "31963Shane Black made his directorial debut with the film \"Kiss Kiss Bang Bang\" in 2005.": 0.981567919254303,
    "31963Shane Black's screenplay for \"Lethal Weapon\" significantly influenced his later work in the film industry.": 0.975248396396637,
    "31963Shane Black is primarily known for his work as a novelist and has never been involved in the film industry.": 0.9751651883125305,
    "49543Melilla is a Spanish autonomous city located on the north coast of Africa, sharing a border with Morocco.": 0.9672977924346924,
    "49543Melilla is known for its rich cultural heritage and diverse population.": 0.9581785798072815,
    "49543Melilla is a Moroccan city located on the southern coast of Spain.": 0.9621409773826599,
    "26691\"In the End\" received positive reviews from music critics, who praised the song's piano riff and Mike Shinoda's vocal prominence.": 0.9886486530303955,
    "26691\"In the End\" became one of the band's most commercially successful singles.": 0.9700419902801514,
    "26691\"In the End\" was criticized for lacking a distinctive piano riff and minimal vocal contribution from Mike Shinoda.": 0.9834954142570496,
    "169032Manmohan Singh was re-elected as Prime Minister of India after serving a full five-year term.": 0.9246174693107605,
    "169032Manmohan Singh was known for his contributions to the economic reforms in India during his tenure.": 0.9287800788879395,
    "169032Manmohan Singh never faced any opposition to his government during his tenure as Prime Minister.": 0.9279789328575134,
    "114795The Hunger Games film is based on a novel written by Suzanne Collins.": 0.9774190187454224,
    "114795The Hunger Games film series was particularly praised for its special effects and soundtrack.": 0.9587110280990601,
    "114795The Hunger Games trilogy of novels was written by Gary Ross.": 0.9658944606781006,
    "208908Bryan Bertino wrote and directed the 2016 American horror film \"The Monster.\"": 0.9700297713279724,
    "208908The song \"The Monster\" by Eminem featuring Rihanna received numerous awards and accolades.": 0.9722932577133179,
    "208908\"The Monster\" is a 2016 horror film directed by Eminem.": 0.97324538230896,
    "38940Google Search can provide weather forecasts and sports scores.": 0.9666262865066528,
    "38940Google Search has a feature that recommends nearby restaurants based on user preferences.": 0.964158833026886,
    "38940Google Search does not offer any information on time zones or stock quotes.": 0.9662564396858215,
    "131576Yara Shahidi is known for her role as Zoey on the sitcom Black-ish.": 0.9618480205535889,
    "131576Yara Shahidi has been featured in several fashion magazines due to her work as a model.": 0.9581135511398315,
    "131576Yara Shahidi was born in 1995 and is best known for her role in horror films.": 0.9621157646179199,
    "46873Joni Mitchell released her 17th album of original songs in 2007.": 0.979086697101593,
    "46873Joni Mitchell's album \"Dog Eat Dog\" features collaborations with several famous musicians.": 0.9761035442352295,
    "46873Joni Mitchell's last album of original songs was released in 1985.": 0.9781805276870728,
    "72220Janelle Monáe is signed to her own imprint, Wondaland Arts Society, and Atlantic Records.": 0.9727861881256104,
    "72220Janelle Monáe has received several awards for her contributions to the film industry.": 0.9610036015510559,
    "72220Janelle Monáe is primarily known for her career as a professional athlete.": 0.9652668237686157,
    "161570Baz Luhrmann directed the 2008 film \"Australia,\" which stars Nicole Kidman and Hugh Jackman.": 0.9595357179641724,
    "161570Baz Luhrmann's film \"Australia\" received numerous accolades for its cinematography and costume design.": 0.9549514651298523,
    "161570\"Australia\" is a 2008 science fiction film directed by Baz Luhrmann and starring Nicole Kidman and Hugh Jackman.": 0.9567118287086487,
    "123896Sherilyn Fenn is known for her roles in \"Of Mice and Men\" (1992), \"Boxing Helena\" (1993), and the television sitcom \"Rude Awakening\" (1998-2001).": 0.9903017282485962,
    "123896Sherilyn Fenn has received critical acclaim for her performance in \"Of Mice and Men.\"": 0.9806378483772278,
    "123896Sherilyn Fenn is best known for her role in the science fiction series \"Star Trek.\"": 0.9787355661392212,
    "84799Peter Dinklage appeared in the film \"Underdog\" directed by Frederik Du Chau.": 0.9603679180145264,
    "84799Peter Dinklage's role in \"Underdog\" was widely praised for its comedic timing.": 0.9560086131095886,
    "84799Peter Dinklage has never appeared in any superhero films.": 0.9495381712913513,
    "56381The primary storyline of the series revolves around Lorelai Gilmore's single parenthood and her complex relationship with her wealthy parents, Richard and Emily.": 0.9884281754493713,
    "56381Lorelai Gilmore’s relationship with her best friend forms a significant subplot in the series, adding depth to the main storyline.": 0.9836596846580505,
    "56381Lorelai Gilmore has a supportive and harmonious relationship with her parents, with no significant tension or conflict.": 0.9801050424575806,
    "194794Fortunes of War is a TV series featuring Kenneth Branagh as Guy Pringle, an English Literature lecturer, and Emma Thompson as his wife Harriet during WWII.": 0.9893442392349243,
    "194794ortunes of War, starring Kenneth Branagh and Emma Thompson, received several awards for its historical accuracy and strong performances.": 0.9752904772758484,
    "194794Fortunes of War is a documentary series about military strategies and tactics without any fictional characters.": 0.9778353571891785,
    "141090Mamata Banerjee, commonly known as Didi, has served as the Chief Minister of West Bengal since 2011.": 0.9444366693496704,
    "141090Mamata Banerjee, born on January 5, 1955, wrote an autobiography detailing her journey in politics.": 0.9540281891822815,
    "141090Mamata Banerjee has never held a political office and is not referred to by any nickname.": 0.948836624622345,
    "98475The Quran is considered by Muslims to be a divine revelation from God.": 0.968902051448822,
    "98475The Quran, also known as the Koran, is often studied in religious and academic contexts for its literary and historical value.": 0.969951331615448,
    "98475The Quran is a historical text that has no religious significance in Islam.": 0.9631739854812622,
    "154933James, Viscount Severn, is the youngest grandchild of Queen Elizabeth II and Prince Philip, Duke of Edinburgh.": 0.9838789701461792,
    "154933James, Viscount Severn, enjoys various outdoor activities and is often seen participating in royal family events.": 0.9665439128875732,
    "154933James, Viscount Severn, is the eldest grandchild of Queen Elizabeth II and Prince Philip, Duke of Edinburgh.": 0.9835865497589111,
    "56289Ashley Graham was the first plus-size model to be featured on the cover of the Sports Illustrated Swimsuit Issue in 2016.": 0.9805124402046204,
    "56289Ashley Graham, born on October 30, 1987, has written a memoir about her experiences in the modeling industry.": 0.9747650027275085,
    "56289Ashley Graham has never appeared on the covers of British or American Vogue.": 0.9667988419532776,
    "42096Alba Mons is a massive volcano situated in the northern Tharsis region of Mars.": 0.9780091643333435,
    "42096Alba Mons, along with other Martian volcanoes, is studied to understand the geological history of Mars.": 0.9706858396530151,
    "42096Alba Mons is located on Earth, not Mars, and has no relation to the Tharsis region.": 0.9716426134109497,
    "100456Labyrinth is a television miniseries adapted from a novel by Kate Mosse.": 0.9422881603240967,
    "100456The Last Templar, which aired in 2009, is a Canadian miniseries featuring Mira Sorvino and Scott Foley.": 0.9510983824729919,
    "100456Sebastian Stan has never appeared in any television series or miniseries.": 0.9321876168251038,
    "89519The Crown Prince of Thailand is the designated heir to the Thai throne.": 0.9568799138069153,
    "89519David Packouz, born on February 16, 1982, has written a book about his experiences as an arms dealer.": 0.9597396850585938,
    "89519David Packouz has never been involved in any business or entrepreneurial activities.": 0.9488714933395386,
    "180706Cary Elwes is both an actor and a writer.": 0.9728801250457764,
    "180706Cary Elwes, who was born on October 26, 1962, is best known for his role in a popular fantasy film.": 0.978912353515625,
    "180706Cary Elwes is exclusively a professional musician and has never acted or written professionally.": 0.9722885489463806,
    "113361Eurotas (river) is not in Europe.": 0.9522301554679871,
    "200290Natural Born Killers was based upon Tarantino's original screenplay without modifications": 0.9797587990760803,
    "95271Keith Stanfield is a vocalis.": 0.9341796636581421,
    "120983Trouble with the Curve was not directed by a squid.": 0.9473646283149719,
    "86543Sam Claflin starred in Pirate of the Caribbean: At World's End.": 0.980216920375824,
    "15058Taylor Lautner appeared on television drama.": 0.954422652721405,
    "9277Pocahontas became, in her lifetime, a kind of superstar and was noted in the context and culture she lived in.": 0.9756819605827332,
    "53254Shooter don't cast a dog in the lead role.": 0.9545922875404358,
    "70412Blue Jasmine has Cate Blanchett leading it.": 0.9591095447540283,
    "206984Punch-Drunk Love was not distributed by Revolution Studios.": 0.9735285639762878,
    "161537Baz Luhrmann's film Australia stars a Chinese actor, vocalist, and producer.": 0.9603192806243896,
    "123193Harris Jayaraj was not born in February of 1975.": 0.9702224135398865,
    "37792Janet Leigh was a human.": 0.9120270013809204,
    "41091In the British Virgin Islands and Turks and Caicos Islands, the United States dollar is not the sole currency.": 0.9860225319862366,
    "180698Cary Elwes is a multimillionaire.": 0.9478331208229065,
    "100145The Silver Surfer appears always in Icelandic comic books.": 0.9566712379455566,
    "17555Amy Winehouse was born on 12 July 2011.": 0.9597484469413757,
    "198547Catherine Hardwicke was born as Helen Catherine Hardwicke and changed her name in 2011.": 0.9845411777496338,
    "66638The Adventures of Pluto Nash was not reviewed by Ron Underwood.": 0.97138911485672,
    "204301The Latvian Soviet Socialist Republic is not known as Soviet Latvia.": 0.9560214281082153,
    "157517Microbiologist research challenges information found in immunology.": 0.9763321876525879,
    "77869A River Runs Through It has won a Academy Award.": 0.9683340191841125,
    "203694Poseidon grossed $181,674,817 at the worldwide box office.": 0.9854203462600708,
    "185728Mani Ratnam is widely credited with revolutionising Tamil food industry.": 0.9871131777763367,
    "177196Dub music occurred after reggae.": 0.9509162306785583,
    "59048Sam Claflin is not an actor.": 0.9574318528175354,
    "127416Wish Upon stared Joey King.": 0.9009955525398254,
    "187536Matthew Vaughn droped out college on March 7th, 1971.": 0.9575931429862976,
    "18346Brie Larson was not in a starring role in the movie Short Term 12.": 0.9732375144958496,
    "218103The Indian National Congress was founded on December, 1885.": 0.9669243097305298,
    "197631The University of Leicester neglected to the discovery of the remains of King Richard III.": 0.9855261445045471,
    "140556Kleshas cloud the heart.": 0.9122384190559387,
    "202026Tamerlan Tsarnaev did not have a male sibling.": 0.9461951851844788,
    "19074House of Balloons is by a Japanese songwriter and producer.": 0.9705193042755127,
    "207543Mel B published a song on Virgin Records in 2007.": 0.9781625270843506,
    "99924AMGTV is not a British television network.": 0.9534339308738708,
    "131782James VI and I was a governor.": 0.918523907661438,
    "225283Michaela Watkins is not a comedian.": 0.9414085149765015,
    "175462In 1978, Christian Gottlob Neefe was dead.": 0.9561203122138977,
    "50213Physics' main goal is not to understand the creation of the universe.": 0.9586453437805176,
    "80358The Prowler was created by Marvel Comics.": 0.9703457355499268,
    "119389Alan Rickman isn't the only actor in A Good Day to Die\n": 0.9576987028121948,
    "144899AMGTV does not have entertainment TV shows.": 0.9569388031959534,
    "214265DJ Quik is a hip hop performer from New York city.": 0.9720518589019775,
    "194446The Pacers were constituted as a fellow member of the ABA in 1967.": 0.9619193077087402,
    "46059Bhagat Singh was an example of a folk hero.": 0.9640806317329407,
    "160067Levoamphetamine is not a CNS excitant.": 0.9484086036682129,
    "40465Joe Rogan comes along in a Canadian baseball situation comedy.": 0.965996265411377,
    "203186Polynesian languages are constituted by a large amount of languages.": 0.9460673928260803,
    "76847Abdul-Jabbar is not ranked 3rd all-time in passes.": 0.9176445007324219,
    "188962William Cohen was born in America.": 0.9348894357681274,
    "140589The CONCACAF is brings together  for Central America's football unions.": 0.9643283486366272,
    "44347May of 1964 is the birthday of Duff McKagan": 0.9648070931434631,
    "164893Hezbollah received political support from Syria": 0.9728453755378723,
    "73934Poseidon doesen't earned money at the international box office.": 0.97109055519104,
    "179018Steve Ditko wasn't a sketch expert.": 0.9402626156806946,
    "183505Estelle Getty was not born in Russia.": 0.9533694386482239,
    "88641Birmingham is not a topographic point.": 0.9332187175750732,
    "23766Charles de Gaulle was a Polish chief of the Resistance": 0.9665253758430481,
    "7436Simon Pegg entered the world on February 14th, 1860.": 0.9638134837150574,
    "200388A cult was formed by Tom DeLonge": 0.9499104619026184,
    "86630DC illustrated stories was the only ones where The Silver Surfer shows up": 0.9389069676399231
}